color1 = input("Введите первый основной цвет (красный, синий, желтый): ")
color2 = input("Введите второй основной цвет (красный, синий, желтый): ")
if {color1, color2} == {"красный", "синий"} or {color1, color2} == {"синий", "красный"}:
    print ("фиолетовый")
elif {color1, color2} == {"красный", "желтый"} or {color1, color2} == {"желтый", "красный"}:
    print ("оранжевый")
elif {color1, color2} == {"синий", "желтый"} or {color1, color2} == {"желтый", "синий"}:
    print ("зеленый")
else:
    print ("ошибка")